

# Задача B. Треугольники

## Условие задачи

Даны два целых положительных числа \( a \) и \( b \).  
Необходимо найти количество различных целых положительных чисел \( c \), таких, что существует невырожденный треугольник с длинами сторон \( a \), \( b \) и \( c \).

Треугольник называется **невырожденным**, если выполняются следующие условия:
1. Все стороны имеют положительную длину.
2. Площадь треугольника положительная.

### Формат входных данных:
- На первой строке находится целое число \( a \).
- На второй строке находится целое число \( b \).  
Условия: \( 1 < a, b < 10^9 \).

### Формат выходных данных:
Выведите одно целое число \( k \), равное количеству подходящих значений \( c \).

### Пример:
#### Ввод:
```
2
2
```

#### Вывод:
```
3
```

---

## Решение

Для определения подходящих значений \( c \), мы используем неравенства треугольника:
1. \( c + a > b \)
2. \( c + b > a \)
3. \( a + b > c \)

Из этих условий вытекает, что:
- \( c > |a - b| \) (чтобы \( c + b > a \) и \( c + a > b \)).
- \( c < a + b \) (чтобы \( a + b > c \)).

Таким образом, \( c \) должно находиться в диапазоне:
\[ |a - b| + 1 \leq c \leq a + b - 1 \]

Если левая граница больше правой (\( |a - b| + 1 > a + b - 1 \)), подходящих \( c \) не существует.

Количество подходящих \( c \) равно количеству целых чисел в диапазоне \([|a - b| + 1, a + b - 1]\), что можно вычислить как:
\[ \text{Количество} = (a + b - 1) - (|a - b| + 1) + 1 \]

---

## Код

```python
def count_valid_c(a, b):

    left = abs(a - b) + 1

    right = a + b - 1

    if left > right:
        return 0 
    return right - left + 1


a = int(input())
b = int(input())

result = count_valid_c(a, b)

print(result)
```

---

## Объяснение кода 

1. **Как треугольник существует:**
   - Чтобы треугольник можно было построить, его стороны должны удовлетворять определенным правилам. Это называется **неравенства треугольника**:
     - Сторона \( c \) должна быть больше разницы \( |a - b| \), чтобы \( c \) вместе с другими сторонами могли образовать треугольник.
     - Сторона \( c \) должна быть меньше суммы \( a + b \), иначе треугольник не получится.
   - Мы называем эти два условия "левой границей" (\( |a - b| + 1 \)) и "правой границей" (\( a + b - 1 \)).

2. **Проверяем, есть ли подходящий диапазон:**
   - Если левая граница больше правой, то \( c \) не может находиться в диапазоне между ними. Это значит, что подходящих значений \( c \) нет, и мы возвращаем \( 0 \).

3. **Сколько чисел подходит:**
   - Когда диапазон подходит, мы просто считаем количество чисел между левой и правой границами, включая сами границы. Это можно вычислить как:
     \[
     Количество = Правая граница - Левая граница + 1
     \]
   - Например, если левая граница равна 3, а правая равна 7, то числа: 3, 4, 5, 6, 7. Их пять. 

4. **Почему код работает быстро:**
   - Алгоритм выполняет всего несколько математических операций, чтобы найти диапазон и посчитать количество чисел. Он не использует циклы или сложные вычисления, поэтому работает мгновенно, даже для очень больших чисел \( a \) и \( b \).

---

### Пример на реальных числах

Представим, что:
- \( a = 3 \)
- \( b = 5 \)

1. **Находим диапазон для \( c \):**
   - Левая граница: \( |3 - 5| + 1 = 3 \)
   - Правая граница: \( 3 + 5 - 1 = 7 \)

   Значит, \( c \) может быть любым числом от 3 до 7 включительно.

2. **Подсчитываем подходящие значения \( c \):**
   - Числа в диапазоне: \( 3, 4, 5, 6, 7 \)
   - Количество чисел: \( 5 \)

3. **Результат:**
   - Программа вернет \( 5 \), потому что это количество возможных значений \( c \).

---

## Примеры работы

### Пример 1:
#### Ввод:
```
2
2
```
#### Вывод:
```
3
```
**Объяснение:**  
Диапазон для \( c \):  
- Левая граница: \( |2 - 2| + 1 = 1 \).
- Правая граница: \( 2 + 2 - 1 = 3 \).  
Числа в диапазоне: \( 1, 2, 3 \).

### Пример 2:
#### Ввод:
```
3
5
```
#### Вывод:
```
5
```
**Объяснение:**  
Диапазон для \( c \):  
- Левая граница: \( |3 - 5| + 1 = 3 \).
- Правая граница: \( 3 + 5 - 1 = 7 \).  
Числа в диапазоне: \( 3, 4, 5, 6, 7 \).

---

### Похожие задачи

---

#### 1. **Максимальная длина третьей стороны треугольника**

**Задача**: Найти максимальное значение \( c \), при котором \( a, b, c \) могут образовать треугольник.

##### Условие:
На вход подаются два числа \( a \) и \( b \). Необходимо вывести максимальное значение \( c \), которое удовлетворяет условиям существования треугольника:
- \( c + a > b \)
- \( c + b > a \)
- \( a + b > c \)

##### Пример:
Ввод:
```
3
5
```

Вывод:
```
7
```


#### 2. **Минимальное значение третьей стороны**

**Задача**: Найти минимальное значение \( c \), при котором \( a, b, c \) могут образовать треугольник.

##### Условие:
На вход подаются два числа \( a \) и \( b \). Необходимо вывести минимальное значение \( c \), которое удовлетворяет условиям существования треугольника:
- \( c + a > b \)
- \( c + b > a \)
- \( a + b > c \)

##### Пример:
Ввод:
```
3
5
```

Вывод:
```
3
```

---

#### 3. **Проверка возможности построения треугольника**

**Задача**: Написать функцию, которая проверяет, можно ли построить треугольник с заданными сторонами \( a \), \( b \), \( c \).

##### Условие:
На вход подаются три числа \( a \), \( b \), \( c \). Если \( a, b, c \) удовлетворяют условиям существования треугольника, вывести `YES`, иначе — `NO`.

##### Пример:
Ввод:
```
3
5
7
```

Вывод:
```
YES
```

---

#### 1. **Количество возможных треугольников**

**Задача**: Дано целое число \( n \). Найти количество различных треугольников с длинами сторон \( a, b, c \), где \( 1 \leq a, b, c \leq n \).

##### Условие:
Для всех \( a, b, c \), удовлетворяющих \( 1 \leq a, b, c \leq n \), посчитать количество наборов, которые удовлетворяют неравенствам треугольника.

##### Пример:
Ввод:
```
5
```

Вывод:
```
34
```

---

#### 2. **Максимальная площадь треугольника**

**Задача**: Даны три стороны \( a, b, c \). Найти максимальную площадь треугольника с такими сторонами.

##### Условие:
На вход подаются три числа \( a \), \( b \), \( c \). Если \( a, b, c \) могут образовать треугольник, вывести его площадь. В противном случае вывести `0`.

##### Пример:
Ввод:
```
3
4
5
```

Вывод:
```
6.0
```


---
